# IsParameterOverridden Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarContainerParameterManager..::..IsParameterOverridden Method
RebarContainerParameterManager Class See Also
---
Checks if the parameter has an override
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public bool IsParameterOverridden(
	ElementId paramId
)
```

Visual Basic
---
```text
Public Function IsParameterOverridden ( _
	paramId As ElementId _
) As Boolean
```

Visual C++
---
```text
public:
bool IsParameterOverridden(
	ElementId^ paramId
)
```

# ### Parameters
paramId
    Type: Autodesk.Revit.DB..::..ElementId The id of the parameter element
# ### Return Value
True if the parameter has an override
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
RebarContainerParameterManager Class
Autodesk.Revit.DB.Structure Namespace